"""
数据类型转换第五弹
    dict():其他类型转字典类型
    1.数字类型不可以转换成容器类型
    2.字符串不可以转字典类型，因为字符串不可以生成二级容器
    3.列表类型转字典类型，列表必须为登场二级容器，子容器中的元素个数必须为2
    4.元组类型转字典类型，元组必须为登场二级容器，子容器中的元素个数必须为2
    5.集合不能转字典类型
"""
a = 123
b = "abc123"
# 数字类型和字符串不能转
# print(dict(a))
# print(dict(b))
c  = [1,2,3,"我"]
# 必须是二级容器
# print(dict(c))

cc = [[1,2],["a","b"],["名字", "sqh"]]
print(dict(cc))
d = ((1,2),("a","b"),("名字","sqh"))
print(dict(d))

e = {1,2,3,4,5}
# 集合转不了
# print(dict(e))
"""
运行结果：
{1: 2, 'a': 'b', '名字': 'sqh'}
{1: 2, 'a': 'b', '名字': 'sqh'}
"""